flood-test/loadtest.yml
config:
  target: "ws://198.23.211.34:4000"
  phases:
    - duration: 60
      arrivalRate: 20

scenarios:
  - engine: socketio
    flow:
      - function: "setEmail"
      - connect:
          auth:
            email: "{{ email }}"
      - emit:
          channel: "join"
          data:
            roomId: "default"
      - think: 2
      - emit:
          channel: "answer"
          data:
            answer: "A"
      - think: 1
      - on:
          channel: "game_state"
          then:
            - log: "收到 game_state"

processor:
  functions:
    setEmail: |
      function (userContext, events, done) {
        const uuid = Math.random().toString(36).substring(2, 10);
        userContext.vars.email = `user_${uuid}@gmail.com`;
        events.log(`Using email: ${userContext.vars.email}`);
        return done();
      }